s = "Дана строка сим(волов, среди которых есть одна откр)ывающаяся"
print(s)
print(s[s.find("(") + 1:s.find(")")])
print("_______________________________________________________________________")
# s = input("Строка: ")
s = "11 23 44 55 23 22"
# n = input("Ее заменяемая подстрока: ")
n = "23"
# b = input("Новая подстрока: ")
b = "!!!"
new_s = ''
for i in s.split():
    if i != n:
        new_s = new_s + f" {i}"
    else:
        new_s = new_s + f" {b}"
print(new_s)
print("_______________________________________________________________________")
s = '''Ежевику для ежат
Принесли два ежа.
Ежевику еле-еле
Ежата возле ели съели'''
print(s)
count = 0
for i in range(len(s.split())):
    if s.split()[i].find("е") == 0 or s.split()[i].find("Е") == 0:
        count += 1
print("Количество слов начинающихся на 'е': ", count)
print("_______________________________________________________________________")
