#
# a= set(input("Введите первую строку: "))
# b= set(input("Введите вторую строку: "))
a = set("Python")
b = set("Programming language")
c = a - b
print("Искомыми буквами являются: ")
for i in c:
    print(i, end=" ")
#
# # ______________________________________________________________________________________________________
#
# a=input("Введите строку: ")
a = "Привет, мир!"
vowels = "уеыаоэяию"
def count_vowels(st):
    return sum([1 for x in a.lower() if x in vowels])

print("Количество гласных равно:", count_vowels(a))
#
# ___________________________________________________________________________________________________________
#
# a= set(input("Введите первую строку: "))
# b= set(input("Введите вторую строку: "))
a = set("test")
b = set("string")
c = a | b
print("Искомыми буквами являются: ")
for i in c:
    print(i, end=" ")
#
# _____________________________________________________________________________________________________________
#
# a= set(input("Введите первую строку: "))
# b= set(input("Введите вторую строку: "))
a = set("hello")
b = set("world")
c = a ^ b
print("Искомыми буквами являются: ")
for i in c:
    print(i, end=" ")
